RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_femc_regs.h
/*
 * REN (RW)
 *
 * Refresh enable
 */
#define FEMC_SDRCTRL3_REN_MASK (0x1U)
#define FEMC_SDRCTRL3_REN_SHIFT (0U)
#define FEMC_SDRCTRL3_REN_SET(x) (((uint32_t)(x) << FEMC_SDRCTRL3_REN_SHIFT) & FEMC_SDRCTRL3_REN_MASK)
#define FEMC_SDRCTRL3_REN_GET(x) (((uint32_t)(x) & FEMC_SDRCTRL3_REN_MASK) >> FEMC_SDRCTRL3_REN_SHIFT)

/* Bitfield definition for register: SRCTRL0 */
/*
 * ADVH (RW)
 *
 * ADV hold state
 * 0b - ADV is high during address hold state
 * 1b - ADV is low during address hold state
 */
#define FEMC_SRCTRL0_ADVH_MASK (0x800U)
#define FEMC_SRCTRL0_ADVH_SHIFT (11U)
#define FEMC_SRCTRL0_ADVH_SET(x) (((uint32_t)(x) << FEMC_SRCTRL0_ADVH_SHIFT) & FEMC_SRCTRL0_ADVH_MASK)
#define FEMC_SRCTRL0_ADVH_GET(x) (((uint32_t)(x) & FEMC_SRCTRL0_ADVH_MASK) >> FEMC_SRCTRL0_ADVH_SHIFT)

/*
 * ADVP (RW)
 *
 * ADV polarity
 * 0b - ADV is active low
 * 1b - ADV is active high
 */
#define FEMC_SRCTRL0_ADVP_MASK (0x400U)
#define FEMC_SRCTRL0_ADVP_SHIFT (10U)
#define FEMC_SRCTRL0_ADVP_SET(x) (((uint32_t)(x) << FEMC_SRCTRL0_ADVP_SHIFT) & FEMC_SRCTRL0_ADVP_MASK)
#define FEMC_SRCTRL0_ADVP_GET(x) (((uint32_t)(x) & FEMC_SRCTRL0_ADVP_MASK) >> FEMC_SRCTRL0_ADVP_SHIFT)

/*
 * ADM (RW)
 *
 * address data mode
 * 00b - address and data MUX mode
 * 11b - address and data non-MUX mode
 */
#define FEMC_SRCTRL0_ADM_MASK (0x300U)
#define FEMC_SRCTRL0_ADM_SHIFT (8U)
#define FEMC_SRCTRL0_ADM_SET(x) (((uint32_t)(x) << FEMC_SRCTRL0_ADM_SHIFT) & FEMC_SRCTRL0_ADM_MASK)
#define FEMC_SRCTRL0_ADM_GET(x) (((uint32_t)(x) & FEMC_SRCTRL0_ADM_MASK) >> FEMC_SRCTRL0_ADM_SHIFT)

/*
 * PORTSZ (RW)
 *
 * port size
 * 0b - 8bit
 * 1b - 16bit
 */
#define FEMC_SRCTRL0_PORTSZ_MASK (0x1U)
#define FEMC_SRCTRL0_PORTSZ_SHIFT (0U)
#define FEMC_SRCTRL0_PORTSZ_SET(x) (((uint32_t)(x) << FEMC_SRCTRL0_PORTSZ_SHIFT) & FEMC_SRCTRL0_PORTSZ_MASK)
#define FEMC_SRCTRL0_PORTSZ_GET(x) (((uint32_t)(x) & FEMC_SRCTRL0_PORTSZ_MASK) >> FEMC_SRCTRL0_PORTSZ_SHIFT)

/* Bitfield definition for register: SRCTRL1 */
/*
 * OEH (RW)
 *
 * OE high time, is OEH+1 clock cycles
 */
#define FEMC_SRCTRL1_OEH_MASK (0xF0000000UL)
#define FEMC_SRCTRL1_OEH_SHIFT (28U)
#define FEMC_SRCTRL1_OEH_SET(x) (((uint32_t)(x) << FEMC_SRCTRL1_OEH_SHIFT) & FEMC_SRCTRL1_OEH_MASK)
#define FEMC_SRCTRL1_OEH_GET(x) (((uint32_t)(x) & FEMC_SRCTRL1_OEH_MASK) >> FEMC_SRCTRL1_OEH_SHIFT)

/*
 * OEL (RW)
 *
 * OE low time, is OEL+1 clock cycles
 */
#define FEMC_SRCTRL1_OEL_MASK (0xF000000UL)
#define FEMC_SRCTRL1_OEL_SHIFT (24U)
#define FEMC_SRCTRL1_OEL_SET(x) (((uint32_t)(x) << FEMC_SRCTRL1_OEL_SHIFT) & FEMC_SRCTRL1_OEL_MASK)
#define FEMC_SRCTRL1_OEL_GET(x) (((uint32_t)(x) & FEMC_SRCTRL1_OEL_MASK) >> FEMC_SRCTRL1_OEL_SHIFT)

/*
 * WEH (RW)
 *
 * WE high time, is WEH+1 clock cycles
 */
#define FEMC_SRCTRL1_WEH_MASK (0xF00000UL)
#define FEMC_SRCTRL1_WEH_SHIFT (20U)
#define FEMC_SRCTRL1_WEH_SET(x) (((uint32_t)(x) << FEMC_SRCTRL1_WEH_SHIFT) & FEMC_SRCTRL1_WEH_MASK)
#define FEMC_SRCTRL1_WEH_GET(x) (((uint32_t)(x) & FEMC_SRCTRL1_WEH_MASK) >> FEMC_SRCTRL1_WEH_SHIFT)

/*
 * WEL (RW)
 *
 * WE low time, is WEL+1 clock cycles
 */
#define FEMC_SRCTRL1_WEL_MASK (0xF0000UL)
#define FEMC_SRCTRL1_WEL_SHIFT (16U)
#define FEMC_SRCTRL1_WEL_SET(x) (((uint32_t)(x) << FEMC_SRCTRL1_WEL_SHIFT) & FEMC_SRCTRL1_WEL_MASK)
#define FEMC_SRCTRL1_WEL_GET(x) (((uint32_t)(x) & FEMC_SRCTRL1_WEL_MASK) >> FEMC_SRCTRL1_WEL_SHIFT)

/*
 * AH (RW)
 *
 * Address hold time, is AH+1 clock cycles
 */
#define FEMC_SRCTRL1_AH_MASK (0xF000U)
#define FEMC_SRCTRL1_AH_SHIFT (12U)
#define FEMC_SRCTRL1_AH_SET(x) (((uint32_t)(x) << FEMC_SRCTRL1_AH_SHIFT) & FEMC_SRCTRL1_AH_MASK)
#define FEMC_SRCTRL1_AH_GET(x) (((uint32_t)(x) & FEMC_SRCTRL1_AH_MASK) >> FEMC_SRCTRL1_AH_SHIFT)

/*
 * AS (RW)
 *
 * Address setup time, is AS+1 clock cycles
 */
#define FEMC_SRCTRL1_AS_MASK (0xF00U)
#define FEMC_SRCTRL1_AS_SHIFT (8U)
#define FEMC_SRCTRL1_AS_SET(x) (((uint32_t)(x) << FEMC_SRCTRL1_AS_SHIFT) & FEMC_SRCTRL1_AS_MASK)
#define FEMC_SRCTRL1_AS_GET(x) (((uint32_t)(x) & FEMC_SRCTRL1_AS_MASK) >> FEMC_SRCTRL1_AS_SHIFT)

/*
 * CEH (RW)
 *
 * Chip enable hold time, is CEH+1 clock cycles
 */
#define FEMC_SRCTRL1_CEH_MASK (0xF0U)
#define FEMC_SRCTRL1_CEH_SHIFT (4U)
#define FEMC_SRCTRL1_CEH_SET(x) (((uint32_t)(x) << FEMC_SRCTRL1_CEH_SHIFT) & FEMC_SRCTRL1_CEH_MASK)
#define FEMC_SRCTRL1_CEH_GET(x) (((uint32_t)(x) & FEMC_SRCTRL1_CEH_MASK) >> FEMC_SRCTRL1_CEH_SHIFT)

/*
 * CES (RW)
 *
 * Chip enable setup time, is CES+1 clock cycles
 */
#define FEMC_SRCTRL1_CES_MASK (0xFU)
#define FEMC_SRCTRL1_CES_SHIFT (0U)
#define FEMC_SRCTRL1_CES_SET(x) (((uint32_t)(x) << FEMC_SRCTRL1_CES_SHIFT) & FEMC_SRCTRL1_CES_MASK)
#define FEMC_SRCTRL1_CES_GET(x) (((uint32_t)(x) & FEMC_SRCTRL1_CES_MASK) >> FEMC_SRCTRL1_CES_SHIFT)

/* Bitfield definition for register: SADDR */
/*
 * SA (RW)
 *
 * Slave address
 */
#define FEMC_SADDR_SA_MASK (0xFFFFFFFFUL)
#define FEMC_SADDR_SA_SHIFT (0U)
#define FEMC_SADDR_SA_SET(x) (((uint32_t)(x) << FEMC_SADDR_SA_SHIFT) & FEMC_SADDR_SA_MASK)
#define FEMC_SADDR_SA_GET(x) (((uint32_t)(x) & FEMC_SADDR_SA_MASK) >> FEMC_SADDR_SA_SHIFT)

/* Bitfield definition for register: DATSZ */
/*
 * DATSZ (RW)
 *
 * Data Size in Byte
 * When IP command is not a write/read operation, DATSZ field would be ignored.
 * 000b - 4
 * 001b - 1
 * 010b - 2
 * 011b - 3
 * 100b - 4
 * 101b - 4
 * 110b - 4
 * 111b - 4
 */
#define FEMC_DATSZ_DATSZ_MASK (0x7U)
#define FEMC_DATSZ_DATSZ_SHIFT (0U)
#define FEMC_DATSZ_DATSZ_SET(x) (((uint32_t)(x) << FEMC_DATSZ_DATSZ_SHIFT) & FEMC_DATSZ_DATSZ_MASK)
#define FEMC_DATSZ_DATSZ_GET(x) (((uint32_t)(x) & FEMC_DATSZ_DATSZ_MASK) >> FEMC_DATSZ_DATSZ_SHIFT)

/* Bitfield definition for register: BYTEMSK */
/*
 * BM3 (RW)
 *
 * Byte Mask for Byte 3 (IPTXD bit 31:24)
 * 0b - Byte Unmasked
 * 1b - Byte Masked
 */
#define FEMC_BYTEMSK_BM3_MASK (0x8U)
#define FEMC_BYTEMSK_BM3_SHIFT (3U)
#define FEMC_BYTEMSK_BM3_SET(x) (((uint32_t)(x) << FEMC_BYTEMSK_BM3_SHIFT) & FEMC_BYTEMSK_BM3_MASK)
#define FEMC_BYTEMSK_BM3_GET(x) (((uint32_t)(x) & FEMC_BYTEMSK_BM3_MASK) >> FEMC_BYTEMSK_BM3_SHIFT)

